tutorials/tube/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.000137278;


boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
	mixingLength	0.00042;
        value           uniform 0.000137278;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.000137278;
    }
    tube
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }
    front
    {
        type            wedge;     
    }
    back
    {
        type            wedge;  
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
