tutorials/tube/0/v2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      v2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-20;


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-20;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1e-20;
    }
    tube
    {
        type            fixedValue;
        value           uniform 1e-20;
    }
    front
    {
        type            wedge;     
    }
    back
    {
        type            wedge;  
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
