tutorials/tube/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
    T
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    }

    alpha
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
 //       relTol          0.1;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      yes;

    residualControl
    {
        p           1e-5;
        U           1e-3;
        T           1e-8;
        alpha       1e-6;
        "(k|epsilon|omega|f|v2)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p           0.3;
    }
    equations
    {
        U               0.3;
        T               0.3;
        alpha           0.1;
    }
}


// ************************************************************************* //
